Revit 2027 API
NumberingSchemaTypes.StructuralNumberingSchemas.RebarCoupler Property
 Built-in schema used for numbering rebar coupler elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static NumberingSchemaType RebarCoupler { get; }
Public Shared ReadOnly Property RebarCoupler As NumberingSchemaType
	Get
public:
static property NumberingSchemaType^ RebarCoupler {
	NumberingSchemaType^ get ();
}
static member RebarCoupler : NumberingSchemaType with get
Property Value
NumberingSchemaType
See Also
Reference
NumberingSchemaTypes.StructuralNumberingSchemas Class
Autodesk.Revit.DB Namespace